design/design.md
```mermaid
graph TD;
  user(User) -->|mTLS| auth_scheme(Auth Scheme)
  auth_scheme --> rate_limiter(Rate Limiter)
  rate_limiter --> least_conn(Least Connection)
  least_conn --> upstream1(Upstream 1)
  least_conn --> upstream2(Upstream 2)
  subgraph server[Server]
    auth_scheme
    rate_limiter
    least_conn
    subgraph forwarder[Forwarder]
      rate_limiter
      least_conn
    end
  end
  class user person;
```
